<template>
  <div class="ff-500-18 text">
    <p>
      Это web-приложение, которое позволяет вести учет электросчетчиков на
      предприятии.
    </p>
    <!-- <p>
        Когда вы заходите на сайт, всплывает окно для ввода логина и пароля. Для
        доступа к приложению, необходимо быть зарегистрированым пользователем.
        Зарегистрировать в приложение Вас может администратор.
      </p>
      <p><img src="../assets/images/doc/login.png" alt="login window" /></p> -->

    <h1>Страница Счетчики</h1>
    <p>
      При открытии сайта Вы попадаете на страницу, где отображается таблица со
      Счетчиками. Также при нажатии на кнопку
      <button class="btn-menu">Счетчики</button> в верхнем меню, Вам также
      открывается эта Страница
    </p>
    <p>
      С помощью кнопки
      <button class="btn-add">+ Добавить счетчик</button> открывается форма
      добавления нового счетчика.
    </p>
    <h2>Форма добавления/редактирования нового счетчика</h2>
    <ul>
      <li>
        <span class="label">№ Павильона</span> - павильон, в котором находиться
        счетчик
      </li>
      <li>
        <span class="label">№ Места</span> - киоск или место в павильоне, в
        котором находиться счетчик
      </li>
      <li>
        <span class="label">Тип счетчика</span> - в этом поле нужно указать,
        механический или цифровой тип, либо другой тип
      </li>
      <li><span class="label">№ Счетчика</span> - заводской номер счетчика.</li>
      <li>
        <span class="label">Разрядность счетчика</span> - количество цифр
        показания счетчика
      </li>
      <li>
        <span class="label">Дата изготовления</span> - когда был изготовлен
        счетчик. Указывается на счетчике
      </li>
      <li>
        <span class="label">Дата установки</span> - когда был установлен счетчик
        в помещение
      </li>
      <li>
        <span class="label">Арендатор</span> - необходимо выбрать текущего
        арендатора, который арендует это помещение
      </li>
      <li>
        <span class="label">№ родительского счетчика</span> - здесь необходимо
        ввести номер счетчика, через который подключен данный счетчик
      </li>
      <li>
        <span class="label">Дополнительная информация</span> - в это поле можно
        вводить любой текст.
      </li>
    </ul>
    <h2>Редактирование счетчика</h2>
    <p>
      При наведении на поле "№ Счетчика" в выпадающем меню можно выбрать "<span
        class="brown"
        >Редактировать</span
      >" и в окне редактирования внести изменения по счетчику
    </p>
    <h2>Удаление счетчика</h2>
    <p>
      При наведении на поле "№ Счетчика" в выпадающем меню можно выбрать "<span
        class="red"
        >Удалить</span
      >". Счетчик не удаляется из базы данных, а помечается, как удаленный.
      Показать все удаленные счетчики можно, нажав в верхнем поле на ссылку
      "Неактивные".
    </p>
    <h2>Начисления по счетчику</h2>
    <p>
      При клике на номер счетчика, либо выбрав в выпадающем меню "Начисления",
      показывается таблица начислений по выбранному счетчику. С помощью кнопки
      <button class="btn-add">+ Добавить начисление</button> открывается окно,
      где можно внести показания для начисления.
    </p>
    <ul>
      <li>
        <span class="label">За месяц</span> - выбрать месяц, за который
        производятся начисления. <span class="label">год</span> - выбрать год,
        за который производятся начисления
      </li>
      <li>
        <span class="label">Текущие показания</span> - внести текущие показания,
        которые сняли.
      </li>
      <li>
        <span class="label">Предыдущие показания</span> - внести последние
        предыдущие показания.
      </li>
      <li>
        <span class="label">Тариф</span> - внести тариф, по которому будет
        рассчитываться сумма оплаты.
      </li>
      <li>
        <span class="label">Дата</span> - внести дату, когда вы заносите данные
        в базу (по умолчанию ставиться текущая дата и время).
      </li>
      <li>
        <span class="label">Дополнительная информация</span> - в это поле можно
        внести любой текст.
      </li>
    </ul>
    <h2>Редактирование начислений</h2>
    <p>
      При нажатии на поле Период(Месяц), открывается окно редактирования
      выбранного начисления. Отредактировать возможно только НЕоплаченные
      начисления
    </p>
    <h2>Оплата начислений(квитанций)</h2>
    <p>
      Нажав на кнопку "<span class="needpay">Оплата</span> ", открывается окно,
      где можно заполнить данные по оплате:
    </p>
    <ul>
      <li>
        <span class="label">Номер чека про оплату</span> - вводится номер чека,
        который выдает ваш кассовый аппарат
      </li>
      <li>
        <span class="label">Сумма оплаты</span> - введите сумму, которую
        оплачивает арендатор по этой квитанции. По умолчанию ставиться полная
        сумма оплаты.
      </li>
      <li>
        <span class="label">Дата</span> - дата занесения оплаты. По умолчанию
        ставиться текущая дата и время.
      </li>
      <li>
        <span class="label">Дополнительная информация</span> - в это поле можно
        внести любой текст.
      </li>
    </ul>
    <h2>Массовая оплата начислений(квитанций)</h2>
    <p>
      Выбрав с помощью чекбокса неоплаченые квитанции, и нажав в боковом меню на
      иконку
      <img src="../components/icons/money.svg" alt="payment" width="25" />
      "Оплатить", открывается окно, где можно внести сумму оплаты за несколько
      выбранных начислений и произвести оплату одним чеком.
    </p>
    <h2>Печать уведомлений по начислениям</h2>
    <p>
      Выбрав с помощью чекбокса неоплаченные начисления(квитанции) и нажав в
      боковом меню кнопку
      <img src="../components/icons/printer.svg" alt="printer" width="25" />
      "Напечатать" в другой вкладке открываеются Уведомления по выбранным
      начислениям(квитанциям) в формате .pdf, которые потом можно сохранить или
      вывести на печать
    </p>
    <h2>Удаление начислений(квитанций)</h2>
    <p>
      Выбрав с помощью чекбокса НЕоплаченные начисления(квитанции) и нажав в
      боковом меню кнопку
      <img src="../components/icons/ben.svg" alt="ben" width="25" />
      "Удалить", выбранные начисления(квитанции) будут удалены
    </p>
    <h2>Квитанция об оплате</h2>
    <p>
      Если начисление оплачено или частично оплачено, то нажав на любом поле
      начисления, откроется окно, где будут данные об оплате(ах) по этому
      начислению
    </p>

    <h1>Страница Арендаторы</h1>
    <p>
      С помощью кнопки
      <button class="btn-menu">Арендаторы</button> "Арендаторы" в верхнем меню,
      открывается страница с таблицей арендаторов.
    </p>
    <p>
      С помощью кнопки
      <button class="btn-add">+ Добавить арендатора</button> открывается форма
      добавления нового арендатора.
    </p>
    <h2>Форма добавления нового арендатора</h2>
    <ul>
      <li><span class="label">Имя</span> - введите имя арендатора</li>
      <li><span class="label">Фамилия</span> - введите фамилию арендатора</li>
      <li>
        <span class="label">Свидетельство</span> - введите свидетельсво
        регистрации арендатора
      </li>
      <li><span class="label">Паспорт</span> - введите паспорт арендатора</li>
      <li><span class="label">Адрес</span> - введите адрес арендатора</li>
      <li>
        <span class="label">Форма компании</span> - введите форму компании
        арендатора. Например ФОП или Юр.лицо
      </li>
      <li>
        <span class="label">Телефон 1</span> - введите первый телефон арендатора
      </li>
      <li>
        <span class="label">Телефон 2</span> - введите второй телефон арендатора
      </li>
      <li><span class="label">E-mail</span> - введите e-mail арендатора</li>
      <li>
        <span class="label">Дополнительная информация</span> - в это поле можно
        внести любой текст.
      </li>
    </ul>
    <h2>Редактирование арендатора</h2>
    <p>
      В поле "Действия", нажав на иконку
      <img src="../components/icons/edit.svg" alt="Edit" width="25" />
      "Редактирование", откроется форма редактирования арендатора
    </p>

    <h1>Форма поиска</h1>
    <p>
      На каждой странице над таблицей есть форма поиска. Возможно фильтровать
      данные таблицы по любому полю.
    </p>
  </div>
</template>

<style scoped>
ul li {
  margin-bottom: 10px;
}
.text {
  line-height: 1.5;
}
.label {
  border: 1px solid black;
  border-radius: 6px;
  padding: 3px;
}
</style>
