<template>
  <div class="ff-500-18">
    <p>
      Це web-додаток, який дозволяє вести облік електролічильників на
      підприємстві.
    </p>
    <!-- <p>
        Когда вы заходите на сайт, всплывает окно для ввода логина и пароля. Для
        доступа к приложению, необходимо быть зарегистрированым пользователем.
        Зарегистрировать в приложение Вас может администратор.
      </p>
      <p><img src="../assets/images/doc/login.png" alt="login window" /></p> -->

    <h1>Сторінка Лічильники</h1>
    <p>
      При відкритті сайту Ви потрапляєте на сторінку, де відображається таблиця
      з Лічильниками. Також при натисканні на кнопку
      <button class="btn-menu">Лічильники</button> у верхньому меню, Вам також
      відкривається ця Сторінка
    </p>
    <p>
      За допомогою кнопки
      <button class="btn-add">+ Додати лічильник</button> відкривається форма
      додавання нового лічильника.
    </p>
    <h2>Форма додавання/редагування нового лічильника</h2>
    <ul>
      <li>
        <span class="label">№ Павільйону</span> - павільйон, в якому знаходиться
        лічильник
      </li>
      <li>
        <span class="label">№ Місця</span> - кіоск або місце в павільйоні, в
        якому знаходиться лічильник
      </li>
      <li>
        <span class="label">Тип лічильника</span> - у цьому полі потрібно
        вказати, механічний або цифровий тип, або інший тип лічильника
      </li>
      <li>
        <span class="label">№ Лічильника</span> - заводський номер лічильника.
      </li>
      <li>
        <span class="label">Розрядність лічильника</span> - кількість цифр
        показника лічильника
      </li>
      <li>
        <span class="label">Дата виготовлення</span> - коли був виготовлений
        лічильник. Вказується на лічильнику.
      </li>
      <li>
        <span class="label">Дата встановлення</span> - коли було встановлено
        лічильник у приміщення
      </li>
      <li>
        <span class="label">Орендар</span> - необхідно вибрати поточного
        орендаря, який орендує приміщення, в якому встановлено лічильник
      </li>
      <li>
        <span class="label">№ батьківського лічильника</span> - тут необхідно
        ввести номер лічильника, через який підключений цей лічильник
      </li>
      <li>
        <span class="label">Додаткова інформація</span> - у це поле можна
        вводити будь-який текст.
      </li>
    </ul>
    <h2>Редагування лічильника</h2>
    <p>
      При наведенні на поле "№ Лічильника" у меню, що випадає, можна вибрати
      "<span class="brown">Редагувати</span>" та у вікні редагування внести
      зміни по лічильнику
    </p>
    <h2>Видалення лічильника</h2>
    <p>
      При наведенні на поле "№ Лічильника" у меню, що випадає, можна вибрати
      "<span class="red">Видалити</span>". Лічильник не видаляється з бази
      даних, а позначається як видалений. Показати всі видалені лічильники
      можна, натиснувши у верхньому полі посилання "Неактивні".
    </p>
    <h2>Нарахування за лічильником</h2>
    <p>
      При натисканні на номер лічильника або вибравши у випадаючому меню
      "Нарахування", показується таблиця нарахувань за вибраним лічильником. За
      допомогою кнопки
      <button class="btn-add">+ Додати нарахування</button> відкривається вікно,
      де можна зробити показання для нарахування.
    </p>
    <ul>
      <li>
        <span class="label">За місяць</span> - вибрати місяць, за який
        провадяться нарахування. <span class="label">рік</span> - вибрати рік,
        за який здійснюються нарахування
      </li>
      <li>
        <span class="label">Поточні показання</span> - внести поточні показання,
        які зняли.
      </li>
      <li>
        <span class="label">Попередні показання</span> - внести останні
        попередні показання.
      </li>
      <li>
        <span class="label">Тариф</span> - внести тариф, за яким буде
        розраховуватись сума оплати.
      </li>
      <li>
        <span class="label">Дата</span> - внести дату, коли ви заносите дані в
        базу (за умовчанням ставиться поточна дата та час).
      </li>
      <li>
        <span class="label">Додаткова інформація</span> - у цьому полі можна
        внести будь-який текст.
      </li>
    </ul>
    <h2>Редагування нарахувань</h2>
    <p>
      При натисканні на полі Період(Місяць) відкривається вікно редагування
      обраного нарахування. Відредагувати можна лише НЕоплачені нарахування
    </p>
    <h2>Оплата нарахувань (квитанцій)</h2>
    <p>
      Натиснувши кнопку "<span class="needpay">Оплата</span> ", відкривається
      вікно, де можна заповнити дані щодо оплати:
    </p>
    <ul>
      <li>
        <span class="label">Номер чека про оплату</span> - вводиться номер чека,
        який видає ваш касовий апарат
      </li>
      <li>
        <span class="label">Сума оплати</span> - введіть суму, яку оплачує
        орендар за цією квитанцією. За замовчуванням ставиться повна сума
        оплати.
      </li>
      <li>
        <span class="label">Дата</span> - дата внесення оплати. За замовчуванням
        ставиться поточна дата та час.
      </li>
      <li>
        <span class="label">Додаткова інформація</span> - у цьому полі можна
        внести будь-який текст.
      </li>
    </ul>
    <h2>Масова оплата нарахувань (квитанцій)</h2>
    <p>
      Вибравши за допомогою чекбоксу неоплачені квитанції, та натиснувши в
      бічному меню на іконку
      <img src="../components/icons/money.svg" alt="payment" width="25" />
      "Оплатити" відкривається вікно, де можна внести суму оплати за кілька
      обраних нарахувань та здійснити оплату одним чеком.
    </p>
    <h2>Друк повідомлень щодо нарахувань</h2>
    <p>
      Вибравши за допомогою чекбоксу неоплачені нарахування (квитанції) і
      натиснувши у бічному меню кнопку
      <img src="../components/icons/printer.svg" alt="printer" width="25" />
      "Надрукувати", в іншій вкладці відкриваються Повідомлення за вибраними
      нарахуваннями (квитанціями) у форматі .pdf, які потім можна зберегти або
      вивести на друк
    </p>
    <h2>Видалення нарахувань (квитанцій)</h2>
    <p>
      Вибравши за допомогою чекбоксу НЕоплачені нарахування (квитанції) і
      натиснувши у бічному меню кнопку
      <img src="../components/icons/ben.svg" alt="ben" width="25" />
      "Видалити", вибрані нарахування (квитанції) будуть видалені
    </p>
    <h2>Квитанція про оплату</h2>
    <p>
      Якщо нарахування сплачено або частково сплачено, то натиснувши на
      будь-якому полі нарахування, відкриється вікно, де будуть дані про
      оплату(ах) з цього нарахування
    </p>

    <h1>Сторінка Орендарі</h1>
    <p>
      За допомогою кнопки
      <button class="btn-menu">Орендарі</button> "Орендарі" у верхньому меню,
      відкривається сторінка із таблицею орендарів.
    </p>
    <p>
      За допомогою кнопки
      <button class="btn-add">+ Додати орендаря</button> відкривається форма
      додавання нового орендаря.
    </p>
    <h2>Форма додавання нового орендаря</h2>
    <ul>
      <li><span class="label">Ім'я</span> - введіть ім'я орендаря</li>
      <li><span class="label">Прізвище</span> - введіть прізвище орендаря</li>
      <li>
        <span class="label">Свідоцтво</span> - введіть свідоцтво реєстрації
        орендаря
      </li>
      <li><span class="label">Паспорт</span> - введіть паспорт орендаря</li>
      <li><span class="label">Адреса</span> - введіть адресу орендаря</li>
      <li>
        <span class="label">Форма компанії</span> - введіть форму компанії
        орендаря. Наприклад ФОП або Юр.
      </li>
      <li>
        <span class="label">Телефон 1</span> - введіть перший телефон орендаря
      </li>
      <li>
        <span class="label">Телефон 2</span> - введіть другий телефон орендаря
      </li>
      <li><span class="label">E-mail</span> - введіть e-mail орендаря</li>
      <li>
        <span class="label">Додаткова інформація</span> - у цьому полі можна
        внести будь-який текст.
      </li>
    </ul>
    <h2>Редагування орендаря</h2>
    <p>
      У полі "Дії", натиснувши на іконку
      <img src="../components/icons/edit.svg" alt="Edit" width="25" />
      "Редагування", відкриється форма редагування орендаря
    </p>

    <h1>Форма пошуку</h1>
    <p>
      На кожній сторінці над таблицею є форма пошуку. Можливо фільтрувати дані
      таблиці з будь-якого поля.
    </p>
  </div>
</template>

<style scoped>
ul li {
  margin-bottom: 10px;
}
.label {
  border: 1px solid black;
  border-radius: 6px;
  padding: 3px;
}
</style>
